# EqualityFormula Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EqualityFormula Property
ParameterTypeId Class See Also
---
"Equality Formula"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EqualityFormula { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EqualityFormula As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EqualityFormula {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace